ETL/DataProcessors/ВыгрузкаЭталонныхСправочников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаЭталонныхСправочников</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ETL/Enums/ТипыДвиженияДтКт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыДвиженияДтКт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОборотДт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОборотКт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстатокДт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстатокКт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ETL/Catalogs/СтатьиБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>СтатьиБюджетов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Бюджеты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АналитикаПоЭлементамЗатрат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементЗатратОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоЭлементамДоходов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Доходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлементДоходовОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоТоварыПродукцияУслуги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварыПродукцияУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварыИУслуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварыПродукцияУслугиОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоВерсии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоКонтрагентам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентыОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоКомпаниям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпанииОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоПериодам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоСценариям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарииОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоРынкамСбыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РынокСбытаОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоВидамПерсонала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПерсонала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПерсонала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПерсоналаОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоТипамЗатрат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗатратОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоКаналамПродаж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналыПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналыПродажОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоВидамДвижения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыДвижения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДвижения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыДвиженияОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПоКатегориямАктива</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияАктива1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииАктивов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияАктиваОпеределяетсяАналитикой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПланСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДвиженияДтКт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСправочника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименимостьКФактическимДанным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокСтатейCFI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВключатьВУправленческуюОтчетность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭлементыЗатрат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлементЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭлементыДоходов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлементДоходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Доходы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Счета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПланСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КатегорииАктивов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КатегорияАктива</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкаCFI</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлементСправочника</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Доходы</v8:Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыДвижения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Знак</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДвижения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДвижения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДвижения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыДвиженияДтКт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ETL/DataProcessors/ВыгрузкаЭталонныхСправочников/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ВыгрузитьНаСервере()
	
	РеквизитФормыВЗначение("Объект").Выгрузить();
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	ВыгрузитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьНастройкиОтчетовНаСервере()
	
	РеквизитФормыВЗначение("Объект").ВыгрузитьНастройкиОтчетов();      
	//РеквизитФормыВЗначение("Объект").ВыгрузитьНастройкиОтчетовCFI();      
	ВыгрузитьCFIНаСервере();
//Сообщить(Ном);	
	
КонецПроцедуры

Процедура ДобавитьЗапись(Ссылка,СтатьяЗатрат,СтатьяДоходов,СтатьяДвиженияДенежныхСредств,СтатьяБюджета,ВидДвижения,Знак)
	
			ТекстЗапросаЗаписи = "INSERT INTO [dbo].[map_rpt_ReportLineCFIStructures]
		|           ([ReportLine]
		|           ,[ExpenditureAnalytics]
		|           ,[CashFlowItemAnalytics]
		|           ,[RevenueAnalytics]
		|           ,[ReportLineAnalitycs]
		|           ,[TypesOfMovements]
		|           ,[Sign]
		|           ,[ID])
		|     VALUES
		|           (N'"+XMLСтрока(Ссылка)+"'
		|           ,'"+?(ЗначениеЗаполнено(СтатьяЗатрат),РеквизитФормыВЗначение("Объект").ПреобразоватьОбъектВЗначение(РеквизитФормыВЗначение("Объект").ПолучитьID(СтатьяЗатрат, "map_Expenditures")),0)+"'
		|           ,'"+?(ЗначениеЗаполнено(СтатьяДвиженияДенежныхСредств),РеквизитФормыВЗначение("Объект").ПреобразоватьОбъектВЗначение(РеквизитФормыВЗначение("Объект").ПолучитьID(СтатьяДвиженияДенежныхСредств, "map_CashFlowItems")),0)+"'
		|           ,'"+?(ЗначениеЗаполнено(СтатьяДоходов),РеквизитФормыВЗначение("Объект").ПреобразоватьОбъектВЗначение(РеквизитФормыВЗначение("Объект").ПолучитьID(СтатьяДоходов, "map_Revenues")),0)+"'
		|           ,'"+?(ЗначениеЗаполнено(СтатьяБюджета),РеквизитФормыВЗначение("Объект").ПреобразоватьОбъектВЗначение(РеквизитФормыВЗначение("Объект").ПолучитьID(СтатьяБюджета, "map_rpt_ReportLines")),0)+"'
		//|           ,'"+?(ЗначениеЗаполнено(Выборка.ДтКт),Выборка.ДтКт,NULL)+"'
		|           ,'"+?(ЗначениеЗаполнено(ВидДвижения),РеквизитФормыВЗначение("Объект").ПреобразоватьОбъектВЗначение(РеквизитФормыВЗначение("Объект").ПолучитьID(ВидДвижения, "map_TypesOfMovements")),0)+"'		
		|           ,'"+?(Знак=0,0,Знак)+"'
		|           ,'"+РеквизитФормыВЗначение("Объект").ПолучитьID(Ссылка, "map_rpt_ReportLines")+"')";
		
		Ответ = ИнтеграцияДЗО.ВыполнитьИнструкциюЗаписи(ТекстЗапросаЗаписи);
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыгрузитьНастройкиОтчетов(Команда)
	
	ВыгрузитьНастройкиОтчетовНаСервере();
	ВыгрузитьCFIНаСервере();
КонецПроцедуры   

Процедура ВыгрузитьCFIНаСервере()
	ОбменSQL = Обработки.ОбменSQL.Создать();
	Команда = ОбменSQL.Соединение();
	Команда.CommandText = "
						|TRUNCATE TABLE [dbo].[map_rpt_ReportLineCFIStructures]";	
	Команда.Execute();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатьиБюджетовНастройкаCFI.Ссылка КАК Ссылка,
	               |	СтатьиБюджетовНастройкаCFI.Ссылка.Владелец КАК Владелец,
	               |	СтатьиБюджетовНастройкаCFI.ЭлементСправочника КАК ЭлементСправочника,
	               |	СтатьиБюджетовНастройкаCFI.Знак КАК Знак,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СтатьиБюджетовНастройкаCFI.ЭлементСправочника) = ТИП(Справочник.СтатьиЗатрат)
	               |			ТОГДА СтатьиБюджетовНастройкаCFI.ЭлементСправочника
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК СтатьяЗатрат,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СтатьиБюджетовНастройкаCFI.ЭлементСправочника) = ТИП(Справочник.Доходы)
	               |			ТОГДА СтатьиБюджетовНастройкаCFI.ЭлементСправочника
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК СтатьяДоходов,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СтатьиБюджетовНастройкаCFI.ЭлементСправочника) = ТИП(Справочник.СтатьиБюджетов)
	               |			ТОГДА СтатьиБюджетовНастройкаCFI.ЭлементСправочника
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК СтатьяБюджета,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СтатьиБюджетовНастройкаCFI.ЭлементСправочника) = ТИП(Справочник.СтатьиДвиженияДенежныхСредств)
	               |			ТОГДА СтатьиБюджетовНастройкаCFI.ЭлементСправочника
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	               |	ВЫБОР
	               |		КОГДА СтатьиБюджетовНастройкаCFI.ТипДвижения = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДтКт.ОборотДт)
	               |			ТОГДА ""Дт""
	               |		КОГДА СтатьиБюджетовНастройкаCFI.ТипДвижения = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДтКт.ОборотКт)
	               |			ТОГДА ""Кт""
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ДтКт,
	               |	СтатьиБюджетовНастройкаCFI.ВидДвижения КАК ВидДвижения,
	               |	СтатьиБюджетовНастройкаCFI.Ссылка.Код КАК Код
	               |ИЗ
	               |	Справочник.СтатьиБюджетов.НастройкаCFI КАК СтатьиБюджетовНастройкаCFI
	               |ГДЕ
	               |	НЕ СтатьиБюджетовНастройкаCFI.ЭлементСправочника.Ссылка ЕСТЬ NULL";
	Выборка = Запрос.Выполнить().Выбрать();
	
	//Файл = ПолучитьФайл(ПапкаДляВыгрузкиОбъекта, "data");	 
	Ном = 0;
	Пока Выборка.Следующий() Цикл 
		естьЗапись = Ложь;
		
		Ссылка  						= Выборка.Ссылка;	
		СтатьяЗатрат 					= Выборка.СтатьяЗатрат;
		СтатьяДвиженияДенежныхСредств	= Выборка.СтатьяДвиженияДенежныхСредств;
		СтатьяДоходов 					= Выборка.СтатьяДоходов;
		СтатьяБюджета 					= Выборка.СтатьяБюджета;
		ВидДвижения 					= Выборка.ВидДвижения;
		Знак 							= Выборка.Знак;
		
		Если ЗначениеЗаполнено(СтатьяЗатрат) Тогда
			Запрос = Новый Запрос();                          
			Запрос.Текст = "ВЫБРАТЬ
			|	СтатьиЗатрат.Ссылка КАК Статья
			|ИЗ
			|	Справочник.СтатьиЗатрат КАК СтатьиЗатрат
			|ГДЕ
			|	СтатьиЗатрат.Родитель = &Родитель"; 
			Запрос.УстановитьПараметр("Родитель",СтатьяЗатрат);   
			Рез = Запрос.Выполнить().Выбрать(); 
			Пока рез.Следующий() Цикл
				ДобавитьЗапись(Ссылка,рез.Статья,СтатьяДоходов,СтатьяДвиженияДенежныхСредств,СтатьяБюджета,ВидДвижения,Знак);	
			естьЗапись = истина;
			КонецЦикла;	
			
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(СтатьяДвиженияДенежныхСредств) Тогда
			Запрос = Новый Запрос();                          
			Запрос.Текст = "ВЫБРАТЬ
			               |	СтатьиДвиженияДенежныхСредств.Ссылка КАК Статья
			               |ИЗ
			               |	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
			               |ГДЕ
			               |	СтатьиДвиженияДенежныхСредств.Родитель = &Родитель"; 
			Запрос.УстановитьПараметр("Родитель",СтатьяДвиженияДенежныхСредств);   
			Рез = Запрос.Выполнить().Выбрать(); 
			Пока рез.Следующий() Цикл
				ДобавитьЗапись(Ссылка,СтатьяЗатрат,СтатьяДоходов,рез.Статья,СтатьяБюджета,ВидДвижения,Знак);	
				Ном = Ном+1;
				естьЗапись = истина;
			КонецЦикла;	
			
		КонецЕсли;
		

		Если ЗначениеЗаполнено(СтатьяДоходов) Тогда
			Запрос = Новый Запрос();                          
			Запрос.Текст = "ВЫБРАТЬ
			               |	Доходы.Ссылка КАК Статья
			               |ИЗ
			               |	Справочник.Доходы КАК Доходы
			               |ГДЕ
			               |	Доходы.Родитель = &Родитель"; 
			Запрос.УстановитьПараметр("Родитель",СтатьяДоходов);   
			Рез = Запрос.Выполнить().Выбрать(); 
			Пока рез.Следующий() Цикл
				ДобавитьЗапись(Ссылка,СтатьяЗатрат,рез.Статья,СтатьяДвиженияДенежныхСредств,СтатьяБюджета,ВидДвижения,Знак);	
				Ном = Ном+1;
				естьЗапись = истина;
			КонецЦикла;	
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтатьяБюджета) Тогда
			Запрос = Новый Запрос();                          
			Запрос.Текст = "ВЫБРАТЬ
			               |	СтатьиБюджетов.Ссылка КАК Статья
			               |ИЗ
			               |	Справочник.СтатьиБюджетов КАК СтатьиБюджетов
			               |ГДЕ
			               |	СтатьиБюджетов.Родитель = &Родитель"; 
			Запрос.УстановитьПараметр("Родитель",СтатьяБюджета);   
			Рез = Запрос.Выполнить().Выбрать(); 
			Пока рез.Следующий() Цикл
				ДобавитьЗапись(Ссылка,СтатьяЗатрат,СтатьяДоходов,СтатьяДвиженияДенежныхСредств,рез.Статья,ВидДвижения,Знак);	
				Ном = Ном+1;
				естьЗапись = истина;
			КонецЦикла;	
		КонецЕсли; 
		
		если Не естьЗапись Тогда
			ДобавитьЗапись(Ссылка,СтатьяЗатрат,СтатьяДоходов,СтатьяДвиженияДенежныхСредств,СтатьяБюджета,ВидДвижения,Знак);	
			Ном = Ном+1;
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры	



///временная для интеграции с копией скуль


Процедура ВыгрузитьCFIНаСервереBW_AMD_COPY()
	
	ОбменSQL = Обработки.ОбменSQL.Создать();
	Команда = СоединениеBW_AMD_COPY().Команда;
	Команда.CommandText = "
						|TRUNCATE TABLE [dbo].[map_rpt_ReportLineCFIStructures]";	
	Команда.Execute();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатьиБюджетовНастройкаCFI.Ссылка КАК Ссылка,
	               |	СтатьиБюджетовНастройкаCFI.Ссылка.Владелец КАК Владелец,
	               |	СтатьиБюджетовНастройкаCFI.ЭлементСправочника КАК ЭлементСправочника,
	               |	СтатьиБюджетовНастройкаCFI.Знак КАК Знак,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СтатьиБюджетовНастройкаCFI.ЭлементСправочника) = ТИП(Справочник.СтатьиЗатрат)
	               |			ТОГДА СтатьиБюджетовНастройкаCFI.ЭлементСправочника
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК СтатьяЗатрат,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СтатьиБюджетовНастройкаCFI.ЭлементСправочника) = ТИП(Справочник.Доходы)
	               |			ТОГДА СтатьиБюджетовНастройкаCFI.ЭлементСправочника
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК СтатьяДоходов,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СтатьиБюджетовНастройкаCFI.ЭлементСправочника) = ТИП(Справочник.СтатьиБюджетов)
	               |			ТОГДА СтатьиБюджетовНастройкаCFI.ЭлементСправочника
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК СтатьяБюджета,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СтатьиБюджетовНастройкаCFI.ЭлементСправочника) = ТИП(Справочник.СтатьиДвиженияДенежныхСредств)
	               |			ТОГДА СтатьиБюджетовНастройкаCFI.ЭлементСправочника
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК СтатьяДвиженияДенежныхСредств,
	               |	ВЫБОР
	               |		КОГДА СтатьиБюджетовНастройкаCFI.ТипДвижения = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДтКт.ОборотДт)
	               |			ТОГДА ""Дт""
	               |		КОГДА СтатьиБюджетовНастройкаCFI.ТипДвижения = ЗНАЧЕНИЕ(Перечисление.ТипыДвиженияДтКт.ОборотКт)
	               |			ТОГДА ""Кт""
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ДтКт,
	               |	СтатьиБюджетовНастройкаCFI.ВидДвижения КАК ВидДвижения,
	               |	СтатьиБюджетовНастройкаCFI.Ссылка.Код КАК Код
	               |ИЗ
	               |	Справочник.СтатьиБюджетов.НастройкаCFI КАК СтатьиБюджетовНастройкаCFI
	               |ГДЕ
	               |	НЕ СтатьиБюджетовНастройкаCFI.ЭлементСправочника.Ссылка ЕСТЬ NULL";
	Выборка = Запрос.Выполнить().Выбрать();
	
	//Файл = ПолучитьФайл(ПапкаДляВыгрузкиОбъекта, "data");	 
	Ном = 0;
	Пока Выборка.Следующий() Цикл 
		естьЗапись = Ложь;
		
		Ссылка  						= Выборка.Ссылка;	
		СтатьяЗатрат 					= Выборка.СтатьяЗатрат;
		СтатьяДвиженияДенежныхСредств	= Выборка.СтатьяДвиженияДенежныхСредств;
		СтатьяДоходов 					= Выборка.СтатьяДоходов;
		СтатьяБюджета 					= Выборка.СтатьяБюджета;
		ВидДвижения 					= Выборка.ВидДвижения;
		Знак 							= Выборка.Знак;
		
		Если ЗначениеЗаполнено(СтатьяЗатрат) Тогда
			Запрос = Новый Запрос();                          
			Запрос.Текст = "ВЫБРАТЬ
			|	СтатьиЗатрат.Ссылка КАК Статья
			|ИЗ
			|	Справочник.СтатьиЗатрат КАК СтатьиЗатрат
			|ГДЕ
			|	СтатьиЗатрат.Родитель = &Родитель"; 
			Запрос.УстановитьПараметр("Родитель",СтатьяЗатрат);   
			Рез = Запрос.Выполнить().Выбрать(); 
			Пока рез.Следующий() Цикл
				ДобавитьЗаписьBW_AMD_COPY(Ссылка,рез.Статья,СтатьяДоходов,СтатьяДвиженияДенежныхСредств,СтатьяБюджета,ВидДвижения,Знак);	
			естьЗапись = истина;
			КонецЦикла;	
			
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(СтатьяДвиженияДенежныхСредств) Тогда
			Запрос = Новый Запрос();                          
			Запрос.Текст = "ВЫБРАТЬ
			               |	СтатьиДвиженияДенежныхСредств.Ссылка КАК Статья
			               |ИЗ
			               |	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
			               |ГДЕ
			               |	СтатьиДвиженияДенежныхСредств.Родитель = &Родитель"; 
			Запрос.УстановитьПараметр("Родитель",СтатьяДвиженияДенежныхСредств);   
			Рез = Запрос.Выполнить().Выбрать(); 
			Пока рез.Следующий() Цикл
				ДобавитьЗаписьBW_AMD_COPY(Ссылка,СтатьяЗатрат,СтатьяДоходов,рез.Статья,СтатьяБюджета,ВидДвижения,Знак);	
				Ном = Ном+1;
				естьЗапись = истина;
			КонецЦикла;	
			
		КонецЕсли;
		

		Если ЗначениеЗаполнено(СтатьяДоходов) Тогда
			Запрос = Новый Запрос();                          
			Запрос.Текст = "ВЫБРАТЬ
			               |	Доходы.Ссылка КАК Статья
			               |ИЗ
			               |	Справочник.Доходы КАК Доходы
			               |ГДЕ
			               |	Доходы.Родитель = &Родитель"; 
			Запрос.УстановитьПараметр("Родитель",СтатьяДоходов);   
			Рез = Запрос.Выполнить().Выбрать(); 
			Пока рез.Следующий() Цикл
				ДобавитьЗаписьBW_AMD_COPY(Ссылка,СтатьяЗатрат,рез.Статья,СтатьяДвиженияДенежныхСредств,СтатьяБюджета,ВидДвижения,Знак);	
				Ном = Ном+1;
				естьЗапись = истина;
			КонецЦикла;	
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтатьяБюджета) Тогда
			Запрос = Новый Запрос();                          
			Запрос.Текст = "ВЫБРАТЬ
			               |	СтатьиБюджетов.Ссылка КАК Статья
			               |ИЗ
			               |	Справочник.СтатьиБюджетов КАК СтатьиБюджетов
			               |ГДЕ
			               |	СтатьиБюджетов.Родитель = &Родитель"; 
			Запрос.УстановитьПараметр("Родитель",СтатьяБюджета);   
			Рез = Запрос.Выполнить().Выбрать(); 
			Пока рез.Следующий() Цикл
				ДобавитьЗаписьBW_AMD_COPY(Ссылка,СтатьяЗатрат,СтатьяДоходов,СтатьяДвиженияДенежныхСредств,рез.Статья,ВидДвижения,Знак);	
				Ном = Ном+1;
				естьЗапись = истина;
			КонецЦикла;	
		КонецЕсли; 
		
		если Не естьЗапись Тогда
			ДобавитьЗаписьBW_AMD_COPY(Ссылка,СтатьяЗатрат,СтатьяДоходов,СтатьяДвиженияДенежныхСредств,СтатьяБюджета,ВидДвижения,Знак);	
			Ном = Ном+1;
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыгрузитьCFI(Команда)
	ВыгрузитьCFIНаСервереBW_AMD_COPY();
КонецПроцедуры

Процедура ДобавитьЗаписьBW_AMD_COPY(Ссылка,СтатьяЗатрат,СтатьяДоходов,СтатьяДвиженияДенежныхСредств,СтатьяБюджета,ВидДвижения,Знак)
	
			ТекстЗапросаЗаписи = "INSERT INTO [dbo].[map_rpt_ReportLineCFIStructures]
		|           ([ReportLine]
		|           ,[ExpenditureAnalytics]
		|           ,[CashFlowItemAnalytics]
		|           ,[RevenueAnalytics]
		|           ,[ReportLineAnalitycs]
		|           ,[TypesOfMovements]
		|           ,[Sign]
		|           ,[ID])
		|     VALUES
		|           (N'"+XMLСтрока(Ссылка)+"'
		|           ,'"+?(ЗначениеЗаполнено(СтатьяЗатрат),РеквизитФормыВЗначение("Объект").ПреобразоватьОбъектВЗначение(РеквизитФормыВЗначение("Объект").ПолучитьID(СтатьяЗатрат, "map_Expenditures")),0)+"'
		|           ,'"+?(ЗначениеЗаполнено(СтатьяДвиженияДенежныхСредств),РеквизитФормыВЗначение("Объект").ПреобразоватьОбъектВЗначение(РеквизитФормыВЗначение("Объект").ПолучитьID(СтатьяДвиженияДенежныхСредств, "map_CashFlowItems")),0)+"'
		|           ,'"+?(ЗначениеЗаполнено(СтатьяДоходов),РеквизитФормыВЗначение("Объект").ПреобразоватьОбъектВЗначение(РеквизитФормыВЗначение("Объект").ПолучитьID(СтатьяДоходов, "map_Revenues")),0)+"'
		|           ,'"+?(ЗначениеЗаполнено(СтатьяБюджета),РеквизитФормыВЗначение("Объект").ПреобразоватьОбъектВЗначение(РеквизитФормыВЗначение("Объект").ПолучитьID(СтатьяБюджета, "map_rpt_ReportLines")),0)+"'
		//|           ,'"+?(ЗначениеЗаполнено(Выборка.ДтКт),Выборка.ДтКт,NULL)+"'
		|           ,'"+?(ЗначениеЗаполнено(ВидДвижения),РеквизитФормыВЗначение("Объект").ПреобразоватьОбъектВЗначение(РеквизитФормыВЗначение("Объект").ПолучитьID(ВидДвижения, "map_TypesOfMovements")),0)+"'		
		|           ,'"+?(Знак=0,0,Знак)+"'
		|           ,'"+РеквизитФормыВЗначение("Объект").ПолучитьID(Ссылка, "map_rpt_ReportLines")+"')";
		
		
	//Ответ = ИнтеграцияДЗО.ВыполнитьИнструкциюЗаписи(ТекстЗапросаЗаписи);

	СтркутураСоединения = СоединениеBW_AMD_COPY();
	Попытка
		СтркутураСоединения.Соединение.Execute(ТекстЗапросаЗаписи,,128);
	Исключение  
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры	


Функция СоединениеBW_AMD_COPY() Экспорт
	
	НастройкиОбмена = Константы.ОсновныеНастройкиОбмена.Получить();
	База  = НастройкиОбмена.БазаДанныхSQL;
	База  = "BW_AMD_COPY";
	
	Попытка
		
		Команда     = Новый COMОбъект("ADODB.Command");
		Выборка     = Новый COMОбъект("ADODB.RecordSet");
		Соединение  = Новый COMОбъект("ADODB.Connection");
		
		Соединение.ConnectionString = "DRIVER={SQL Server};" + "SERVER=" + НастройкиОбмена.ИнстансSQL + ";" + "UID=" + НастройкиОбмена.ЛогинSQL + ";" + "PWD=" + НастройкиОбмена.ПарольSQL +";" + "DATABASE=" + База + ";";
		
		Соединение.CommandTimeout	 = 600;
		Соединение.ConnectionTimeout = 180;
		
		Соединение.Open();
		
		Команда.ActiveConnection = Соединение;
		
		
	Исключение
		
		ЗаписьЖурналаРегистрации("Выборка SQL", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
		
		Возврат Неопределено;
		
	КонецПопытки;
	СтркутураСоединения = Новый Структура("Команда,Выборка,Соединение",Команда,Выборка,Соединение);
	Возврат СтркутураСоединения;
	
КонецФункции
